<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>P&aacute;gina personal de Pablo Grisafi</title>
<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />

<!-- Bootstrap -->
<!-- Latest compiled and minified CSS -->
<link rel="stylesheet" href="bootstrap-3.3.2-dist/css/bootstrap.min.css">

<!-- Optional theme -->
<link rel="stylesheet"
	href="bootstrap-3.3.2-dist/css/bootstrap-theme.min.css">
<script src="jquery-2.1.3.js" type="text/javascript"></script>

<!-- Latest compiled and minified JavaScript -->
<script src="bootstrap-3.3.2-dist/js/bootstrap.min.js"></script>

<style type="text/css">
html {
	position: relative;
	min-height: 100%;
}

body {
	/* Margin bottom by footer height */
	margin-bottom: 60px;
}

.footer {
	position: absolute;
	bottom: 0;
	width: 100%;
	/* Set the fixed height of the footer here */
	height: 60px;
	background-color: #f5f5f5;
}
</style>

</head>
<body>

	<div class="container page-header">
		<div class="row">
			<div class="col-md-2">
				<img alt="foto chiquita" src="img/fotito.jpg" />
			</div>
			<div class="col-md-10">
				<h1>
					P&aacute;gina personal de Pablo Andr&eacute;s Grisafi<br> <small>Algo
						as&iacute; como una mezcla de un CV y una carta de
						presentaci&oacute;n para este milenio)</small>
				</h1>
			</div>
		</div>
	</div>
	<div class="container" role="tabpanel">
		<ul class="nav nav-pills" role="tablist">
			<li role="presentation" class="active"><a href="#bienvenido"
				data-toggle="pill" aria-controls="bienvenido">Bienvenido</a></li>
			<li role="presentation"><a href="#contacto" data-toggle="pill"
				aria-controls="contacto">Contacto</a></li>
			<li role="presentation"><a href="#experiencia"
				data-toggle="pill">Experiencia</a></li>
			<li role="presentation"><a href="#proyectos" data-toggle="pill">Proyectos</a></li>
			<li role="presentation"><a href="#redes-sociales"
				data-toggle="pill">Redes sociales</a></li>
			<li role="presentation"><a href="#presencia-web"
				data-toggle="pill">Presencia web</a></li>
		</ul>
		<div class="tab-content">
			<div role="tabpanel" class="tab-pane active" id="bienvenido">
				<p>
					Quinto intento de tener un sitio personal...y no lo estoy
					actualizando como corresponde.<br /> El objetivo de este site
					es...por ahora, exponer un poco de informaci&oacute;n profesional
					sobre m&iacute;. Esta es la p&aacute;gina principal.<br /> En este
					momento est&aacute; absolutamente en desarrollo. Es m&aacute;s, no
					deber&iacute;a haberla publicado. Pero bueno, hay que empezar.
					&Eacute;ste sitio est&aacute; gentilmente hosteado por <a
						href="http://x10hosting.com/">x10hosting</a>.
				</p>
				<p>
					&#161;Ingeniero en Sistemas de informaci&oacute;n!<br /> Recibido
					en diciembre del 2007, UTN-FRBA.<br /> Tengo el t&iacute;tulo en
					mi poder y todo.<br />
				</p>
				<p>Bueno, no hay mucho mas que decir. Pasee un poco por los
					distintos lugares y ver&aacute; si tenemos algo en com&uacute;n, o
					si puedo serle &uacute;til.</p>
			</div>
			<div role="tabpanel" class="tab-pane" id="contacto">
				<p>Quiz&aacute;s esta deber&iacute;a ser la p&aacute;gina de
					entrada. Pero imagino que todos los que visiten esta web
					ser&aacute;n (por ahora al menos) gente que me conoce, as&iacute;
					que no necesitan saber estos datos.</p>
				<table class="table">
					<tbody>
						<tr>
							<td>Email:</td>
							<td><a href="mailto:pablogrisafi1975@gmail.com">pablogrisafi1975@gmail.com</a></td>
						</tr>
						<tr>
							<td>LinkedIn:</td>
							<td><a href="http://ar.linkedin.com/in/pablogrisafi1975">http://ar.linkedin.com/in/pablogrisafi1975</a></td>
						</tr>
					</tbody>
				</table>
				<p>Google tiende a recrear una aplicacion de chat por
					a&ntilde;o, as&iacute; que tuvimos gtalk, hangouts y ahora
					messenger, y ya estoy un poco harto. As&iacute; que si se quiere
					comunicar, los emails van a gmail, el chat a hotmail.</p>
				<p>
					Como curiosidad, puede ver <a
						href="http://www.grifasi-sicilia.com/origininomegrifasi.htm"
						rel="nofollow">el origen de mi apellido</a>.
				</p>
			</div>
			<div role="tabpanel" class="tab-pane" id="experiencia">
				<p>
					Si usted es mi actual o pr&oacute;ximo empleador, pase por alto por
					favor el trato poco formal.<br /> Si le interesa, puede descargar
					mi CV actualizado (en ingl&eacute;s y/o castellano) aqu&iacute;.
					Ambos son breves, una p&aacute;gina y nada m&aacute;s:
				</p>
				<ul id="listcv">
					<li><a
						href="https://docs.google.com/document/d/1kQLnP_UDRNBjn7cI-sdH9BTj6ZaRkdYCLepY42wc_OI/edit?hl=en_US">Curriculum
							Vitae en espa&ntilde;ol</a></li>
					<li><a
						href="https://docs.google.com/document/d/1DD0mpnDjUR4OXq-5Fg58PlakDysrKjzqJPyAIpoO5qY/edit?hl=en_US">Curriculum
							Vitae en ingl&eacute;s</a></li>
				</ul>
				<p>
					Resumiendo muy brevemente, mi nombre es Pablo Grisafi, soy egresado
					de la <a href="http://www.frba.utn.edu.ar/">Universidad
						Tecnol&oacute;gica Nacional, (Facultad Regional Buenos Aires)</a> con
					el t&iacute;tulo de Ingeniero en Sistemas de Informaci&oacute;n.<br />

					He trabajado realizando an&aacute;lisis y desarrollo en lenguaje <a
						href="http://www.oracle.com/technetwork/java/javase/downloads/index.html">Java
					</a> de aplicaciones Web, dentro de frameworks estandard de mercado,
					como <a href="http://www.springsource.org/">Spring</a>/ <a
						href="http://struts.apache.org/">Struts</a>/ <a
						href="http://struts.apache.org/2.x/index.html">Strus2</a>/ <a
						href="http://www.hibernate.org/">Hibernate</a>/ <a
						href="http://www.oracle.com/technetwork/java/javaee/jsp/index.html">JSP</a>,
					y en tambi&eacute;n en la especificaci&oacute;n <a
						href="http://www.oracle.com/technetwork/java/javame/index.html">JME</a>
					para celulares.<br /> Tambi&eacute;n he ganado experiencia
					realizando an&aacute;lisis y desarrollo en lenguaje <a
						href="http://msdn.microsoft.com/en-us/vcsharp/aa336809.aspx">C#</a>
					, dentro del entorno .Net para escritorio y tambi&eacute;n del
					entorno <a
						href="http://msdn.microsoft.com/en-us/netframework/aa497273.aspx">Compact
						Framework</a> para aplicaciones m&oacute;viles bajo WindowsCE y Pocket
					PC.

				</p>
				<p>Podr&iacute;a hacerse la siguiente matriz de mi experiencia
					como programador:</p>
				<table class="table">
					<tbody>
						<tr>
							<td>Lenguaje/Entorno</td>
							<td>Escritorio</td>
							<td>Web</td>
							<td>Movil</td>
						</tr>
						<tr>
							<td>Java</td>
							<td>Si,pero poco</td>
							<td>Si</td>
							<td>Si</td>
						</tr>
						<tr>
							<td>C#</td>
							<td>Si</td>
							<td>No</td>
							<td>Si</td>
						</tr>
					</tbody>
				</table>
				<p>
					O sea, que me falta hacer algo en ASP.NET. Adem&aacute;s tengo que
					decir que me baj&eacute; del desarrollo de aplicaciones
					m&oacute;viles justo cuando se pon&iacute;a interesante: No
					llegu&eacute; a hacer desarrollo para iPhone ni para Android.
					Espero corregir eso alguna vez.<br /> &#161;Ah, cierto!
					Tambi&eacute;n hice algo de <a href="http://www.php.net">PHP</a>,
					pero no es lo m&iacute;o. Prefiero los sistemas m&aacute;s
					estructurados. Aunque tiene su encanto, lo reconozco.
				</p>
				<div class="text-center">
					&Eacute;sta es mi foto profesional:<br /> <img
						alt="Foto profesional" src="img/foto-formal.jpg" /><br /> Me
					falt&oacute; arreglarme la corbata, pero yo me contratar&iacute;a
				</div>
				<p>
					Ahora estoy trabajando en <a href="http://www.despegar.com">Despegar.com</a>
					como lider de proyecto. Estoy trabajando en un conjunto de
					programas que reconcilian ingresos y egresos, usando <a
						href="http://java.sun.com/javase/downloads/index.jsp">Java</a>, <a
						href="http://projects.spring.io/spring-framework/">Spring</a> y <a
						href="http://www.mysql.com/">MySQL</a>
				</p>
				<p>
					Antes trabajaba en <a href="http://www.thewarrantygroup.com">The
						Warranty Group</a> a trav&eacute;s de la consultora <a
						href="http://www.progres.com.ar">Progres</a>. Trabajo en un
					conjunto de aplicaciones desarrolladas usando portlets, con la
					ayuda de <a
						href="http://static.springsource.org/spring/docs/2.0.8/reference/portlet.html">Spring-MVC-Portlet</a>,
					que corren sobre <a href="http://www.liferay.com">Liferay</a>,
					conect&aacute;ndose a bases de datos MS SQLServer y AS400.
				</p>
				<p>
					Antes trabajaba para <a href="http://www.globant.com"
						rel="nofollow">Globant</a> (si no los conocen, no est&aacute;n en
					el rubro) programando en Java para <a
						href="http://www.tdameritrade.com/welcome1.html">TDAmeritrade</a>
					, que es una empresa que permite comprar y vender acciones
					v&iacute;a Internet. As&iacute; que trabajaba bajo
					estrict&iacute;simas condiciones de seguridad. &#161;Me pidieron un
					certificado de antecedentes y todo!(Y vergonzosamente debo
					reconocer que mi prontuario est&aacute; vac&iacute;o)
				</p>
				<p>
					Y antes de eso trabajaba para <a
						href="http://www.networksolutions.com/">NetworkSolutions</a> , una
					empresa verdaderamente pionera en internet: &#161;Fueron los
					primeros vendedores de nombres de dominio! Desarrollaba diversos
					componentes de uso interno de la empresa, principalmente un sistema
					de comunicaci&oacute;n con los clientes, en <a
						href="http://java.sun.com/javase/downloads/index.jsp">Java</a>.
				</p>
				<p>
					M&aacute;s atr&aacute;s en el tiempo trabaj&eacute; para <a
						href="http://www.neoris.com.ar/">Neoris</a> con el t&iacute;tulo
					de SWE / Sr. Consultant, en un producto llamado <a
						href="http://www.neoris.com.ar/EN/expertise/activesuite/activesuite.html">ActiveSuite</a>
					que es sistema completo de gesti&oacute;n de log&iacute;stica. Se
					conecta a <a href="http://www.sap.com/index.epx">SAP</a> y gestiona
					env&iacute;os, viajes, camiones, etc&eacute;tera. Yo hice la parte
					m&oacute;vil, es decir, el programa que el camionero se lleva en su
					Handheld o Smartphone, m&aacute;s varias herramientas de prueba
					internas y una serie de componentes en C# para manejar documentos <a
						href="http://en.wikipedia.org/wiki/Electronic_Data_Interchange">EDI</a>/
					<a href="https://www.sdn.sap.com/irj/sdn/ale">IDOC</a>
				</p>
				<p>
					Y todav&iacute;a m&aacute;s atr&aacute;s trabaj&eacute; para <a
						href="http://www.moviltek.com/">Moviltek</a> , una empresa de
					software que se dedica a realizar aplicaciones web y aplicaciones
					para dispositivos m&oacute;viles.
				</p>
			</div>
			<div role="tabpanel" class="tab-pane" id="proyectos">
				<p>He aqu&iacute; una lista de proyectos descargables
					publicamente en los que he trabajado m&aacute;s por amor al arte
					que por otro motivo.</p>
				<p>
					<a href="http://code.google.com/p/powermock-legacy/"
						class="projectlink"> <img src="img/powermock-legacy.png"
						class="projecticon" alt="powermock-legacy icon" /> <span
						class="projecttitle">powermock-legacy</span>
					</a> Es un retro-fork de PowerMock que me permite hacer funcionar
					PowerMock en Java 1.4. Si, mi trabajo me obligaba a usar esa
					versi&oacute;n pre-hist&oacute;rica.<br /> Estoy bastante
					orgulloso de esto, fue un desaf&iacute;o interesante lograr hacer
					funcionar una aplicaci&oacute;n tan moderna en un lenguaje tan
					desactualizado. Adem&aacute;s mereci&oacute; la atenci&oacute;n de
					los autores originales de PowerMock, que me enviaron un email
					avis&aacute;ndome (&#161;ellos a m&iacute;!) que le pon&iacute;an
					un link desde su p&aacute;gina. Mimos al ego. En fin, lo
					abandon&eacute; porque gracias al cielo ya no necesito usar Java
					1.4 en mi trabajo.
				</p>
				<p>
					<a href="http://code.google.com/p/loderunner-fork/"
						class="projectlink"> <img src="img/loderunner-fork.jpg"
						class="projecticon" alt="loderunner-fork icon" /> <span
						class="projecttitle">loderunner-fork</span>
					</a> <a href="http://en.wikipedia.org/wiki/Lode_Runner">LodeRunner</a>
					es un juego cl&aacute;sico de 1983 que es realmente extraordinario.
					Es adictivo, complejo y la versi&oacute;n original ya
					inclu&iacute;a un editor de niveles, con lo cual tuvo una comunidad
					de creadores de niveles ya en la antig&uuml;dad. Un se&ntilde;
					llamado Fabien Gigante hizo un excelente port para tel&eacute;fono
					celular, que yo disfrut&eacute; mucho. Sin embargo ten&iacute;
					algunos bugs y cierta falta de funcionalidad que me molestaba. Como
					no pude contactarme con el autor, termin&eacute; haciendo un fork
					para a&ntilde;adir la funcionalidad que quer&iacute;a y corregir
					esos problemas. En resumen, mi fork permite elegir el nivel y se
					adapta mejor a distintos tama&ntilde;os de pantalla.
				</p>
				<p>
					<a href="files/Subte.zip" class="projectlink"> <img
						src="img/subte.jpg" class="projecticon" alt="Subte icon" /> <span
						class="projecttitle">&#161;Subte!</span>
					</a>Como su nombre lo indica, es simplemente un programa para ver el
					recorrido del subte aqu&iacute; en Buenos Aires en el celular. Lo
					hice principalmente para jugar un poco con el canvas, y pelearme un
					poco con j2me que estaba medio desentendido. Lo bajan, lo
					descomprimen y copian los dos archivos (jar y jad) al celular, como
					corresponde. Es tan f&aacute;cil de usar que no se para que le puse
					ayuda. Bueno, aprieten 1 si no lo entienden. Nueva versi&oacute;n
					nueva, incluyendo Puan y Carabobo. Cuando Macri me estire la
					l&iacute;nea A hasta San Pedrito prometo actualizarlo. <br />Nobleza
					obliga, si quieren ver algo muy superior, prueben <a
						href="http://sites.google.com/site/ortegaalfredo/smartmap">SmartMap</a>
					.Lo hizo un tal Alfredo Ortega y es &#161;un plano completo de
					Capital Federal para celular! Me deprimi&oacute; mucho cuando lo
					vi, me pas&oacute; el trapo mal. Pero bueno, es mas pesado que mi
					programa, que busca recorridos y todo. &#161;Que mas quieren en
					40k!
				</p>
				<p>
					<a href="files/Clima.zip" class="projectlink"> <img
						src="img/Clima.png" class="projecticon" alt="Clima icon" /> <span
						class="projecttitle">&#161;Clima!</span>
					</a>Se conecta a Internet y obtiene informaci&oacute;n del clima actual
					y el pron&oacute;stico meteorol&oacute;gico del <a
						href="http://www.weather.com/">Weather Channel</a>, a
					trav&eacute;s de <a href="http://weather.yahoo.com/">Yahoo
						Weather</a>. Lo hice principalmente para ver como parsear un XML en
					usando kxml, y est&aacute; bastante copiado de <a
						href="http://www.developer.com/ws/article.php/10927_3759471_1">&eacute;ste
						tutorial</a> para aprender a usar Lightweight UI Toolkit....que al
					final no us&eacute;. Se tendr&iacute;a que ver correctamente en
					cualquier modelo, pero...Lo bajan, lo descomprimen y copian los dos
					archivos (jar y jad) al celular, como corresponde.. <br />Me
					parece que el Weather Channel toma la temparatura del Aeroparque de
					Buenos Aires en vez del Observatorio, as&iacute; que tiende a decir
					que hace m&aacute;s fr&iacute;o que el real.
				</p>
				<p>
					<a href="files/chm2html.zip" class="projectlink"> <img
						src="img/chm2html.png" class="projecticon" alt="chm2html icon" />
						<span class="projecttitle">chm2html</span>
					</a>Convierte archivos chm a capetas con un mill&oacute;n de html. Es
					un frontend del HH - decompile. Me serv&iacute;a para leer archivos
					chm (despues de convertrlos, obvio) en mi Jornada 680. &#161;Ah los
					viejos tiempos! Lo pueden bajar, lo ejecutan y tiene la
					opci&oacute;n de instalarlo. Lo que si, antes necesitan el
					.NetFramework 3.0 o superior...eso lo bajan de <a
						href="http://www.microsoft.com/downloadS/details.aspx?familyid=10CC340B-F857-4A14-83F5-25634C3BF043&amp;displaylang=es">ac&aacute;</a>.
				</p>
			</div>
			<div role="tabpanel" class="tab-pane" id="redes-sociales">
				<h3>Las que si</h3>
				<table class="table">
					<tbody>
						<tr>
							<th>Red y enlace al perfil</th>
							<th>Detalles</th>
						</tr>
						<tr>
							<td><a href="http://ar.linkedin.com/in/pablogrisafi1975"><img
									src="img/linkedin.png"
									title="http://ar.linkedin.com/in/pablogrisafi1975"></a></td>
							<td>Me parece que es la red laboral m&aacute;s importante y
								de hecho creo que consegu&iacute; al menos un trabajo gracias a
								ellos. Es la que siempre tengo actualizada, m&aacute;s o menos.
							</td>
						</tr>
						<tr>
							<td><a
								href="http://careers.stackoverflow.com/pablogrisafi1975"><img
									src="img/careers.stackoverflow.png"
									title="http://careers.stackoverflow.com/pablogrisafi1975"></a>
							</td>
							<td>Cuando llegu&eacute; a los 576 puntos en StackOverflow
								me mandaron un mail diciendo "We're impressed by your java tag
								answers on Stack Overflow. In recognition of your generous
								spirit, we'd like to invite you to create a professional profile
								on Stack Overflow Careers 2.0." &#191;C&oacute;mo puedo decirle
								que no a Joel Spolsky y Jeff Atwood?
					</tbody>
				</table>
				<h3>Las que no</h3>
				<table class="table">
					<tbody>
						<tr>

							<td><img src="img/facebook.png"></td>
							<td>Es demasiado social para mi gusto, ya soy un hombre
								grande, felizmente casado, padre de familia.</td>
						</tr>
						<tr>

							<td><img src="img/googleplus.png"></td>
							<td>&#191;Si no tengo el original, por que voy a tener la
								imitaci&oacute;n?</td>
						</tr>
						<tr>
							<td><img src="img/twitter.png"></td>
							<td>&#191;140 caracteres? &#191;Qui&eacute; puede escribir
								tanto?</td>
						</tr>
						<tr>
							<td><img src="img/tinder.png"></td>
							<td>Dije <i>casado</i></td>
						</tr>
						<tr>

							<td><img src="img/orkut.png"></td>
							<td>No soy brasile&ntilde;o (ojo que la prob&eacute; alguna
								vez)</td>
						</tr>
						<tr>

							<td><img src="img/googlebuzz.png"></td>
							<td>&#191;Alguien recuerda esto?</td>
						</tr>
						<tr>

							<td><img src="img/googlewave.png"></td>
							<td>&#191;Y esto?</td>
						</tr>
						<tr>

							<td><img src="img/myspace.png"></td>
							<td>No soy m&uacute;sico</td>
						</tr>
						<tr>

							<td><img src="img/hi5.png"></td>
							<td>Soy mayor de 12 a&ntilde;os.</td>
						</tr>
						<tr>

							<td><img src="img/secondlife.png"></td>
							<td>&#191;todav&iacute;a existe esto? <a
								href="http://secondlife.com/">Parece que si</a>, por algun
								motivo
							</td>
						</tr>
					</tbody>
				</table>
			</div>
			<div role="tabpanel" class="tab-pane" id="presencia-web">
				<p>
					Aqu&iacute; hay una especie de resumen de mis actividades en
					Internet.<br /> &Eacute;sto es lo que a m&iacute; me
					gustar&iacute;a que apareciera si me busco en google.
					Desgraciadamente, mi pasado me condena, como a todos, y hay por
					ah&iacute; m&aacute;s de una p&aacute;gina web en la cual figura mi
					nombre, que quisiera que fuera borrada de la memoria universal. O
					al menos del cache de google.
				</p>

				Primero que nada, mis proyectos open source, de los cuales ya
				habl&eacute; en la secci&oacute;n <a href="index.php?menu=proyectos">Proyectos</a>
				, pero vuelvo a mencionar brevemente aqu&iacute;:
				<ul class="presencelist">
					<li><a href="http://code.google.com/p/powermock-legacy/">powermock-legacy</a>
						(Un retro fork de powermock que permite correrlo en java 1.4)</li>
					<li><a href="http://code.google.com/p/loderunner-fork/">loderunner-fork</a>
						(Un fork del LodeRunner para j2me de Fabien Gigante con algunas
						mejoras)</li>
				</ul>
				Despu&eacute;s, un art&iacute;culo que logr&eacute; publicar en <a
					href="http://www.codeproject.com">CodeProject</a> que me lo han
				calificado bastante bien:
				<ul class="presencelist">
					<li><a
						href="http://www.codeproject.com/KB/cs/AvoidingInvokeRequired.aspx">AvoidingInvokeRequired</a>
						(Como evitar preguntar if (InvokeRequired) a cada rato en una GUI
						multithread en C#</li>
				</ul>
				&Eacute;sto es extaordinario: me anim&eacute; y mand&eacute; un
				mailcito a la lista de correo de lambda-dev donde se est&aacute;
				desarrollando java8, con closures. Mand&eacute; una sugerencia menor
				<a
					href="http://mail.openjdk.java.net/pipermail/lambda-dev/2012-June/005012.html">
					que pueden ver aqu&iacute;</a> y Brian Goetz, el hombre a cargo del
				asunto, me respondi&oacute; <a
					href="http://mail.openjdk.java.net/pipermail/lambda-dev/2012-June/005013.html">Good
					suggestion. We'll take a look. </a><br /> As&iacute; que si el
				d&iacute;a de ma&ntilde;ana est&aacute;a programando en java, y
				pueden escribir a.isGreaterThan(b) en vez de a.compareTo(b) &gt; 0,
				es gracias a m&iacute;!<br /> <br /> Adem&aacute;s, mis perfiles
				en redes laborales, de los cuales ya habl&eacute; en la
				secci&oacute;n <a href="index.php?menu=redes%20sociales">Redes
					Sociales</a> , pero vuelvo a mencionar brevemente aqu&iacute;:
				<ul class="presencelist">
					<li><a href="http://www.linkedin.com/in/pablogrisafi1975">Perfil
							en LinkedIn</a></li>
					<li><a
						href="http://careers.stackoverflow.com/pablogrisafi1975">Perfil
							en careers.stackoverflow</a></li>
				</ul>
				Me gusta entrar a <a href="http://stackoverflow.com">StackOverflow</a>
				y respondo cada tanto algo, es decir, cuando se me ocurre la
				respuesta
				<ul class="presencelist">
					<li><a
						href="http://stackoverflow.com/users/254307/pablo-grisafi">Perfil
							en StackOverflow</a></li>
				</ul>
				<div class="text-center">
					&#161;Y ya tengo mi flair y todo!<br />
					<div id="flair">
						<a href="http://stackoverflow.com/users/254307/pablo-grisafi">
							<img src="http://stackoverflow.com/users/flair/254307.png"
							width="208" height="58"
							alt="profile for Pablo Grisafi at Stack Overflow, Q&amp;A for professional and enthusiast programmers"
							title="profile for Pablo Grisafi at Stack Overflow, Q&amp;A for professional and enthusiast programmers">
						</a>
					</div>
				</div>


			</div>
		</div>
	</div>

	<footer class="footer">
		<div class="container text-muted">
			<h6>
				El dise&ntilde;o de esta p&aacute;gina es enteramente m&iacute;o, lo
				que muestra mi pobre capacidad est&eacute;tica. Se basa en se basa
				en <a href="http://getbootstrap.com/">bootstrap</a>, como todo lo
				que nos rodea. Esta p&aacute;gina est&aacute; gentil y
				gratuitamentemente hosteada por <a href="http://x10hosting.com/">x10hosting</a>.
				x10hosting te da php, mysql y varias otras cosas m&aacute;s a cambio
				de que entres en su foro una vez cada 15 d&iacute;as. &#161;Eso es
				servicio! El favicon est&aacute; tomado de <a
					href="http://stackoverflow.com">StackOverflow</a> (es la imagen que
				generaron para mi perfil; autom&aacute;ticamente) y convertido de
				formato gracias a <a href="http://favicon.htmlkit.com/">FavIcon
					from Pics</a> <a href="http://validator.w3.org/check?uri=referer">
					<img src="http://www.w3.org/Icons/valid-xhtml10"
					alt="Valid XHTML 1.0 Strict" height="31" width="88" />
				</a>
			</h6>
		</div>
	</footer>
</body>
</html>
